tap 'github/bootstrap'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/formula-analytics'
tap 'homebrew/services'
tap 'homebrew/test-bot'
tap 'homebrew/cask-fonts'
cask 'java8'
cask 'java'
brew 'autojump'
brew 'cmake'
brew 'xz'
brew 'freetype'
brew 'gettext'
brew 'git'
brew 'pkg-config'
brew 'python'
brew 'grc'
brew 'hub'
brew 'jpeg'
brew 'imagemagick'
brew 'jq'
brew 'launch_socket_server', service_restart: true
brew 'launchdns', service_restart: true
brew 'openssl'
brew 'readline'
brew 'mas'
brew 'md5sha1sum'
brew 'memcached', service_restart: true
brew 'nginx', service_restart: true
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'nodenv'
brew 'redis', service_restart: true
brew 'shellcheck'
brew 'ssh-copy-id'
brew 'wget'
brew 'mysql@5.7', restart_service: true
brew 'mongodb'
brew 'thefuck'
brew 'yarn', args: ['without-node']
cask 'abstract'
cask 'appcleaner'
cask 'atom'
cask 'backblaze'
cask 'cyberduck'
cask 'docker'
cask 'firefox'
cask 'font-source-code-pro'
cask 'framer'
cask 'framer-x'
cask 'google-chrome'
cask 'imagealpha'
cask 'imageoptim'
cask 'kap'
cask 'keepingyouawake'
cask 'kindle'
# cask 'local-by-flywheel'
cask 'now'
cask 'numi'
cask 'opera'
cask 'postman'
cask 'sequel-pro'
cask 'sip'
cask 'sketch'
cask 'spotify'
cask 'tunnelbear'
cask 'tyke'
cask 'virtualbox'
cask 'vlc'
cask 'visual-studio-code'
cask 'zoomus'
mas '1Password 7', id: 1333542190
mas 'Xcode', id: 497799835
mas 'Keynote', id: 409183694
mas 'iMovie', id: 408981434
mas 'Slack', id: 803453959
mas 'Pages', id: 409201541
mas 'Pixelmator', id: 407963104
mas 'Numbers', id: 409203825
mas 'iA Writer', id: 775737590
