tap "github/bootstrap"
tap "github/packages"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "homebrew/cask-fonts"
# Shell extension to jump to frequently used directories
brew "autojump"
# Cross-platform make
brew "cmake"
# Good-lookin" diffs with diff-highlight and more
brew "diff-so-fancy"
# Modern replacement for "ls"
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Software library to render fonts
brew "freetype"
# GitHub command-line tool
brew "gh"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Distributed revision control system
brew "git"
# Colorize logfiles and command output
brew "grc"
# Improved top (interactive process viewer)
brew "htop"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Mini DNS server designed solely to route queries to localhost
brew "launchdns", restart_service: true
# Mac App Store command-line interface
brew "mas"
# Hash utilities
brew "md5sha1sum"
# High performance, distributed memory object caching system
brew "memcached", restart_service: true
# Open source relational database management system
brew "mysql@5.7", restart_service: true, link: true
# NCurses Disk Usage
brew "ncdu"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@14"
# Manage multiple NodeJS versions
brew "nodenv"
# Cryptography and SSL/TLS Toolkit
brew "openssl"
# Wrapper to colorize and simplify ping"s output
brew "prettyping"
# Interpreted, interactive, object-oriented programming language
brew "python@3.7"
# Ruby version manager
brew "rbenv"
# Auto-installs gems for Ruby installs
brew "rbenv-default-gems"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Powerful, clean, object-oriented scripting language
brew "ruby@2.4"
# Powerful, clean, object-oriented scripting language
brew "ruby@2.5"
# Powerful, clean, object-oriented scripting language
brew "ruby@2.6"
# Powerful, clean, object-oriented scripting language
brew "ruby@2.7"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Add a public key to a remote machine"s authorized_keys file
brew "ssh-copy-id"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn", args: ["without-node"]
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Collaborative design tool with support for Sketch files
cask "abstract"
# Application uninstaller
cask "appcleaner"
# Data backup and storage service
cask "backblaze"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Monospace code font
cask "font-source-code-pro"
# https://framer.com/
cask "framer"
cask "framer-x"
# Web browser
cask "google-chrome"
# Utility to reduce the size of 24-bit PNG files
cask "imagealpha"
# Tool to optimize images to a smaller size
cask "imageoptim"
# java
cask "java8"
cask "java"
# Open-source screen recorder built with web technology
cask "kap"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Interface for reading and syncing eBooks
cask "kindle"
# cask "local-by-flywheel"
# Multi-platform web browser
cask "microsoft-edge"
# Create deployments right from the tray menu
cask "now"
# Calculator and converter application
cask "numi"
# Open-source software for live streaming and screen recording
cask "obs"
cask "orka"
# Web browser
cask "opera"
# Collaboration platform for API development
cask "postman"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Digital design and prototyping platform
cask "sketch"
# Notepad with a built-in calculator
cask "soulver"
# Music streaming service
cask "spotify"
# Open-source BitTorrent client
cask "transmission"
# VPN client for secure internet access and private browsing
cask "tunnelbear"
# https://tyke.app/
cask "tyke"
# Open-source code editor
cask "visual-studio-code"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Multimedia player
cask "vlc"
# https://zapier.com/zappy
cask "zappy"
# Video communication and virtual meeting platform
cask "zoom"
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
